import { TModuleConfig } from "../../../types/TModule";

export const startConfig: TModuleConfig = {
  commandName: '/start',
  commandDescription: 'Команда для старта бота'
}


export const buildStartMessage = (name: string | undefined) => {
  if (name) {
    return `Привет, ${name}! 👋
  Я — бот для бронирования переговорных комнат  

  📅 Чтобы забронировать переговорную комнату, наберите /book  
  📋 Чтобы посмотреть Ваши бронирования, используйте /my_bookings
  ❌ Чтобы отменить бронирование, наберите /cancel`;
  }
  return startMessageWithoutName;
};


export const startMessageWithoutName = `Привет! 👋
  Я — бот для бронирования переговорных комнат

  📅 Чтобы забронировать переговорную комнату, наберите /book  
  📋 Чтобы посмотреть Ваши бронирования, используйте /my_bookings
  ❌ Чтобы отменить бронирование, наберите /cancel`;

